{
    "main": {
        "name": "Saadat Taaseen",
        "occupation": "Full Stack Software Engineer primarily focused on ReactJS, MongoDB, ExpressJS and NodeJS",
        "description": "Full Stack React Developer by Day, Vocalist/Musician by Night. #ohSaad",
        "image": "ProfilePic.jpeg",
        "bio": "My name is Saadat. I am a recent Bootcamp Graduate from General Assembly. I excel in frameworks such as React, Node, Ruby On Rails, Firebase and databases such as MongoDB and PostgreSQL and I have experience building websites with full CRUD and authentication. Before GA, I worked as a Chemist at a Pharmaceutical Company. I realised that there was no growth opportunity in the occupation I was in, and wanted to use my intellect to be able to build a better life for myself, and help others achieve their goals. After I got laid off due the company's financial drought right before the CoVid19 pandemic, I decided to use the quarantine period to learn coding and improve on my skills. I am grateful and proud for being able to step outside my comfort zone and pursue something that I actually enjoy. I'm passionate about coding and love to challenge myself to learn more and improve my skillset everyday.",
        "contactmessage": "Get in touch with me to receive further details, get coached or anything else.",
        "email": "saadat.taaseen@gmail.com",
        "phone": "(347) 600 - 4353",
        "address": {
            "street": "",
            "city": "New York Metropolitan Area",
            "state": "NY",
            "zip": "11429"
        },
        "website": "",
        "resumedownload": "https://drive.google.com/file/d/10Xxp-xdjhayA86tE9u8b5-DNAh3hM6u4/view?usp=sharing",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/taaseen71/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/ohSaad/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/Taaseen71",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "skillmessage": "I am a recent Bootcamp Graduate from General Assembly. I have experience in frameworks such as React, Node, Ruby On Rails, Firebase and databases such as MongoDB and PostgreSQL and have experience building websites with full CRUD and authentication.",
        "education": [
            {
                "school": "General Assembly",
                "degree": "Software Engineering",
                "graduated": "July 2020",
                "description": "Graduated as a Full Stack Developer"
            },
            {
                "school": "Stony Brook University",
                "degree": "Chemistry",
                "graduated": "Jan 2016",
                "description": "Bachelors of Science in Chemistry"
            }
        ],
        "work": [
            {
                "company": "General Assembly",
                "title": "Software Engineering Fellow",
                "years": "Feb. 2020​ to June 2020​",
                "description": "Completed 18 weeks of Full Stack Web Development training.\nCreated backend servers to contain RESTful APIs, which can be used by front-end frameworks.\nUtilized Model-View-Controller method to build full stack web applications \nCollaborated with UX/UI designers to build a functional website with full CRUD and Authentication \nAccessed multiple third-party-APIs to create a visually appealing website that portrays the information in a cohesive manner."
            },
            {
                "company": "Akorn Pharmaceuticals",
                "title": "Quality Control Scientist",
                "years": "Nov. 2016​ to Feb. 2020​",
                "description": "Perform various chemical and physical tests such as ‘High Pressure Liquid Chromatography’, ‘Dissolution’ of products in chemical media similar to digestive acids, ‘Infrared Spectrophotometry’ and various other experimental methods to ensure product quality meets the required standards for human consumption. \n Responsible for proper and immediate documentation of daily activities. \n Checking specifications to make sure chemicals are ready for release."
            },
            {
                "company": "SanaTax & Bookkeeping Services",
                "title": "Bookkeeper",
                "years": "2014 to April 2016",
                "description": "Organized and filed proper documentation for various client corporations. Filed taxes for small private corporations. Worked with clients to ensure correct information during archiving and for future needs. Using all available information to file taxes for the fiscal year for those same clients."
            }
        ],
        "skills": [
            {
                "name": "React.Js",
                "level": "80%"
            },
            {
                "name": "Ruby on Rails",
                "level": "55%"
            },
            {
                "name": "Node.Js",
                "level": "65%"
            },
            {
                "name": "JavaScript",
                "level": "80%"
            },
            {
                "name": "HTML5",
                "level": "80%"
            },
            {
                "name": "CSS3",
                "level": "90%"
            },
            {
                "name": "Git",
                "level": "60%"
            },
            {
                "name": "MongoDB",
                "level": "70%"
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "title": "Compostrack, Webdesign for easy composting",
                "category": "Created this project in a Hackathon with 5 UX designers and an additional developer. Website has Auth, Maps, a database and a working backend.",
                "image": "compostrack-website.png",
                "url": "https://compostrack.netlify.app"
            },
            {
                "title": "React-Native Image Display",
                "category": "My first React Native app. With no prior knowledge on how to create React-Native apps, the goal was to explore the differences in development compared to ReactJS. Full Stack Build ",
                "image": "React-Native Image Display.png",
                "url": "https://youtu.be/HBldEqXqDB8"
            },
            {
                "title": "React-Music-App",
                "category": "This application was created from scratch. The application uses stored data to play music, presented in a beautiful User Experience. Front-End Build",
                "image": "Saad-Music-App.png",
                "url": "https://saad-music-app.netlify.app/"
            },
            {
                "title": "JavaScript: Pokedex",
                "category": "The project was made with three weeks worth of knowledge of Javascript, and made with only Vanilla JS, HTML and CSS. This was my first project, and I wanted to apply all the information I learned in 3 weeks.",
                "image": "Pokedex.png",
                "url": "https://taaseen71.github.io/SaadsPokedex/"
            },
            {
                "title": "CoVid19 Tracker",
                "category": "This webpage shows the total cases, daily cases, deaths and recoveries, both globally and by country.",
                "image": "CoVid19.png",
                "url": "https://0hsaad-covid19.netlify.app/"
            },
            {
                "title": "Instagram Clone",
                "category": "Instagram Clone created using a React front-end and  Firebase for Database and Authentication.",
                "image": "Instagram.png",
                "url": "https://instaclone-saad.netlify.app/"
            },
            {
                "title": "Shipt Clone",
                "category": "Shipt Clone was created with a group of 3 other develops under strict instructions from a UX/UI developer team. Used the MERN stack to build this application.",
                "image": "ShiptDev.png",
                "url": "http://shiptdev.surge.sh/"
            },
            {
                "title": "ReadIt (Social Media Clone)",
                "category": "Inspiration taken from Reddit, Website uses full CRUD functionalities and use of Authentication to create and comment on posts. This Project uses React Front end and Ruby On Rails backend.",
                "image": "ReadIt.png",
                "url": "https://read-it-saad1.surge.sh/"
            }
        ]
    },
    "testimonials": {
        "testimonials": [
            {
                "text": "",
                "user": ""
            },
            {
                "text": "",
                "user": ""
            }
        ]
    }
}
